Tekla Open API Reference for Tekla Structures 2025
Arc Constructor (ViewBase, Point, Point, Double)
 Creates a new arc instance with standard attributes and the given two points and radius.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Arc(
	ViewBase inView,
	Point inPoint1,
	Point inPoint2,
	double inRadius
)
Public Sub New (
	inView As ViewBase,
	inPoint1 As Point,
	inPoint2 As Point,
	inRadius As Double
)
Parameters
inView
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
inPoint1
Type: Tekla.Structures.Geometry3d.Point
The start point to be used.
inPoint2
Type: Tekla.Structures.Geometry3d.Point
The end point to be used.
inRadius
Type: System.Double
The radius to be used.
See Also
Reference
Arc Class
Arc Overload
Tekla.Structures.Drawing Namespace